{
    "title":"The Close-up Conjuring of Neil Gaiman",
    "subtitle":"Reviewing three collections of short stories",
    "date":"2021-12-30",
    "paragraphs":[
		"Twenty-twenty-one was the year I decided to take short stories seriously as a writer. The only problem was that I hadn’t read many short stories lately. Since I had just finished a delightful MasterClass by Neil Gaiman, I decided to go out and buy all the collections of his short stories available at my local bookstore which, oddly enough, did not include his first collection, Smoke and Mirrors: Short Fictions and Illusions. Instead, I started with his collection of children-friendly stories, M is for Magic, before moving on to Fragile Things: Short Fictions and Wonders and, finally, Trigger Warning. Mr. Gaiman refers to his inspirations as “[c]lose-up conjurors, who, with just twenty-six letters and a handful of punctuation marks, could make you laugh and break your heart, all in a handful of pages.” They have passed the torch, and Neil Gaiman has caught and embraced it.",
		"M is for Magic",
		"This is a collection of short stories suitable for children. It is worth noting that Neil Gaiman does not necessarily treat children the way a lot of grown ups expect children to be treated. He does not coddle. He does, in fact, treat them as people. He trusts that, as people, they can handle some hard lessons, some scary stories, and all the wonderful, magical, and even alien characters, all of which he presents cleverly with his unique brand of honesty and humour.",
		"I highly recommend this book to people with children or even people who were once children. My favorite stories within were probably “Troll Bridge”, which made me cry just a little, and “How to Talk to Girls at Parties”, which made me laugh a lot.",
		"Fragile Things: Short Fictions and Wonders",
		"This book really highlights the range of Neil Gaiman. In “A Study in Emerald” he slips seamlessly into the style of Sir Arthur Conan Doyle while throwing the legendary detective into a fantastically Lovecraftian world. “Other People” is the kind of dark fantasy that makes you want to be a better person. “Goliath” is a reality-questioning sojourn into science-fiction. There are a few stories which fit neatly into the lore of other stories and story-tellers, delighting the avid reader.",
		"My favorite parts of the book, however are “The Flints of Memory Lane”, an exhibition of maximalist story telling, and “Locks”, a touching poem which reminds me of some of the best parts of being a parent.",
		"Trigger Warning",
		"The stories in Trigger Warning are among the most creative I’ve found. Gaiman plays with formats, such as in “Orange”, which is told as the responses to a written questionnaire which is kept from the readers, or “A Calendar of Tales”, which is a collection of twelve stories that pair well with given months. He confidently plays with time, memory, perception, and reality as easily as the rest of us draw air.",
		"Although I have special nostalgia for “The Truth Is a Cave in the Black Mountains…”, which was the first Neil Gaiman story I read, a decade or so ago, I think my favorite story in this collection is “Click-Clack the Rattlebag”, the kind of scary story that I wish I could come up with around a campfire."
    ],
	"tags":[
		"Neil Gaiman",
		"book review",
		"short stories",
		"stories for children"
	],
	"links":[
		{"name": "Neil Gaiman", "link": "https://www.neilgaiman.com/"},
		{"name": "M is for Magic", "link": "https://www.neilgaiman.com/works/Books/M+is+for+Magic/"},
		{"name": "Fragile Things: Short Fictions and Wonders", "link": "https://www.neilgaiman.com/works/Books/Fragile+Things/"},
		{"name": "Trigger Warning", "link": "https://www.neilgaiman.com/works/Books/Trigger+Warning/"}
	]
}