{
    "title":"The State of Mindful Meditation",
    "subtitle":"Reviewing Mindful Meditation by Sima Chowdhury",
    "date":"2022-01-14",
    "paragraphs":[
		"When I was a child, my parents registered me in Wado Kai Karate at a dojo in our small town. There, I had my first exposure to the concept of meditation. The sensei expected us to spend some time at the beginning and end of each instruction clearing our minds. This practice never seemed to work for me because my mind seems to always be busy with multiple trains of thought and no sooner had I pushed one out of my head than another appeared. Speaking with many friends and family members over the years, I have found that many people have had similar experiences with meditation.",
		"The problem, I have since learned, is that I was missing out on the mindfulness aspect of the meditation. Nobody had instructed me to focus on my immediate experience, such as my breathing, the feel of the floor or my gi, or the humming of the fluorescent lights. As an adult, I’ve experienced guided meditation that aids in this mindfulness aspect by giving the participants specific sensations to focus on rather than trying to focus on nothingness. I’ve also learned that one can practice mindfulness not only when meditating but also, to use a few examples from author Sima Chowdhury, while cooking, eating, or brushing one’s teeth.",
		"It’s this form of mindfulness and the accompanying meditation that author Sima Chowdhury explores in Mindful Meditation: Meditation and Mindfulness Interventions to Improve Health and Wellbeing. The author declares in the introduction that this booklet is for people who are curious about mindfulness and meditation, who want more incentive to start or keep practicing the same, or who are advocates of these types of programs. Certainly, Ms. Chowdhury has done all the heavy lifting for anybody who has such an interest. She divided the book into seven sections covering topics such as attending to emotional distress, building skills, and brain health and recovery, the latter of which the author is especially familiar with, writing from the perspective of a traumatic brain injury survivor. Ms. Chowdhury expertly researched each section and combined her experience with the latest and greatest of peer-reviewed research into the benefits of mindful meditation in all aspects of a person’s life.",
		"I quite enjoyed seeing just how much research has gone into this topic and learned several applications of mindful meditation that are new to me and do recommend this book to others."
    ],
	"tags":[
		"Sima Chowdhury",
		"book review",
		"non-fiction",
		"mindfulness",
		"meditation",
		"Canadian creators"
	],
	"links":[
		{"name": "Mindful Meditation on Amazon.ca", "link": "https://www.amazon.ca/dp/B09NF87WTB"},
		{"name": "Sima Chowdhury on Twitter", "link": "https://twitter.com/mytravelpapers"}
	]
}