{
    "title":"Wishing For More Wishes",
    "subtitle":"A review of Careful of Thy Wishes by P.D. Workman",
    "date":"2022-02-04",
    "paragraphs":[
		"Just released in January of 2022, Careful of Thy Wishes by P.D. Workman is my first must-read of the year. I was, at first, hesitant to jump into the Reg Rawlins, Psychic Investigator, series at book thirteen. Any misgivings I had, however, were very much misplaced. Despite being a mystery story with the in-depth world building of an urban fantasy series, I found it quite accessible and the book did a great job of getting me up to speed on the necessary characters and their history. That’s not to say that I feel spoiled on the previous twelve books, though, and I think I will pick up the start of the Reg Rawlins series later this year.",
		"For a story about a psychic investigator which features a witch, a warlock, and a family of fairies, I can’t help but applaud the relatable human aspect of all the characters in Careful of Thy Wishes. Author P.D. Workman clearly understands the hearts of her characters and is able to bring them to life with every word. The dialogue especially shines in every scene with main character Reg Rawlins demonstrating a great and unique rapport with each of the supporting cast. Even Reg’s cat, or maybe especially the cat, seems like a very real character with familiar personality.",
		"I feel it is important to point out that P.D. Workman is quickly becoming one of the most prolific writers in the mystery genre, with over 70 published titles since she started in 2013. In that collection there is something for everybody, with the cozy mysteries of Auntie Clem’s Bakery; the supernatural exploits of Reg Rawlins, Psychic Investigator; the hard-hitting young adult Between the Cracks series; and more. I highly recommend checking out them all."
    ],
	"tags":[
		"P.D. Workman",
		"book review",
		"mystery",
		"supernatural",
		"Canadian creators"
	],
	"links":[
		{"name": "P.D. Workman", "link": "https://pdworkman.com/"},
		{"name": "Careful of Thy Wishes", "link": "https://pdworkman.com/careful-of-thy-wishes/"}
	]
}